rails_server/app/controllers/levels_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."level" = $1  [["level", 1]]
---
    def score
        @scores = Score.where(level: params[:level])

INSERT INTO "scores" ("name", "score", "level") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdfjaklsdfa"], ["score", 500000], ["level", 1]]
---
    def post
        data = params[:levels]
        @score = Score.new(:name => data[:name], :score => data[:score], :level => data[:level])
        if @score.save